public/posts/enterprise_linux/index.html
<!DOCTYPE html>
<html data-theme="light" lang="en-us"
  dir="ltr">

<head>  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, viewport-fit=cover">
<meta http-equiv="X-UA-Compatible" content="IE = edge, chrome = 1">

<title>
  Enterprise Linux? @ qrvhh
</title>

<meta name="description" content=" Why? Since it&#39;s release earlier this year, I have been using Red Hat…">

<meta name="generator" content="Hugo 0.150.0">

<link rel="canonical" href="http://localhost:1313/posts/enterprise_linux/">

<meta property="og:type" content="website">

<meta property="og:locale" content="en-us">
<meta property="og:title" content='Enterprise Linux? @ qrvhh'>
<meta property="og:site_name" content="qrvhh">
<meta property="og:description" content=" Why? Since it&#39;s release earlier this year, I have been using Red Hat…">
<meta property="og:url" content="http://localhost:1313/posts/enterprise_linux/">

<meta property="og:image" content="">
<meta name="twitter:image" content="">

<meta name="twitter:card" content="summary_large_image">

<link rel="shortcut icon" href="/assets/imgs/favicon.ico">
<link rel="icon" type="image/png" sizes="32x32" href="/assets/imgs/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/assets/imgs/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="/assets/imgs/apple-touch-icon.png">




<link rel="stylesheet" href="/assets/scss/custom.min.css">







<link rel="stylesheet" href="/assets/scss/main.min.css">

























</head>

<body>
  <header>
    <nav class="navbar">
        <div class="navbar-top" id="top">
            <div class="navbar-logo">
                <a href="http://localhost:1313/" class="logo-text" style="font-family: jicaleta;">
                    
                    qrvhh
                    
                </a>
            </div>
            <div class="navbar-burger" id="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        <div class="navbar-menu" id="navbar-menu">
            <div class="navbar-link-list">
                
                <a href="/" class="navbar-link-item">Home</a>
                
                <a href="/about" class="navbar-link-item">About</a>
                
                <a href="/posts" class="navbar-link-item">Archives</a>
                
                <a href="/search" class="navbar-link-item">Search</a>
            </div>
            <div class="theme-toggle">
                <div id="theme-toggle-btn">
                    <svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 24 24">
                        <path fill="#1a1a1a"
                            d="M10 2c-1.82 0-3.53.5-5 1.35C8 5.08 10 8.3 10 12s-2 6.92-5 8.65C6.47 21.5 8.18 22 10 22a10 10 0 0 0 10-10A10 10 0 0 0 10 2" />
                    </svg>
                </div>
            </div>
        </div>
    </nav>
</header>

  <main>
    



<h1>Enterprise Linux?</h1>

<div class="article-tag">
  
  <span class="article-author">By&nbsp;</span>
  
  
  <time datetime="2025-09-20T16:31:33">Posted on 2025-09-20</time>
  
  
</div>


<div id="outline-container-headline-1" class="outline-3">
<h3 id="headline-1">
Why?
</h3>
<div id="outline-text-headline-1" class="outline-text-3">
<p>
Since it&#39;s release earlier this year, I have been using Red Hat Enterprise Linux 10 almost exclusively as my daily driver. Well, on my home computer, as I&#39;m forced to use Windows for my day-job.
It might feel like a weird choice, given how there is Fedora Linux, which can be thought of as a more modern iteration of RHEL (given how it&#39;s the upstream project). The thing is, I&#39;ve used Fedora before, but I could never become fully commited to it - sure, I love the near-stock Gnome experience, but that&#39;s not an exclusive to Fedora.
The reason why I&#39;ve managed to stay on RHEL for longer than 2 months is exactly this: I kind of forgot about it. It&#39;s stable in a sense that I got bored running &#34;dnf update&#34; daily, just to see &#34;Everything is up to date&#34;. In fact, I don&#39;t even remember when was the last time I opened the terminal to run an update.
There are other stable distributions - Debian, Suse, openSuse Leap, Rocky… - and yet I&#39;m on a commercial offering. And there are two other reasons for that: me preparing for Red Hat Certifications for my job, and the fact that Red Hat gives out free licenses. If Suse would do the same, I probably would never have left it, but that&#39;s another story for another time.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
My desktop
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
I love Gnome, vanilla or heavily customized (looking at you, Ubuntu), matters little to me, as the workflow doesn&#39;t change much in either case.
Of course, I use <em>quite</em> some extensions, but I don&#39;t agree with some others, who think Gnome should implement the most popular extensions as a base system offering. Part of the reason why I love Gnome is the fact that it&#39;s almost a blank sheet out of the box, that you can extend with… extensions. It&#39;s similar to how other DEs are praised for their customizability - you can do that too in Gnome, just in a different way.
The only thing I miss is the reimagined &#34;Activities&#34; button, that shows your workspaces, but I&#39;ve enabled an extension that basically does the same.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
My workflow
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
I&#39;m trying to use Emacs recently for as many tasks as I possibly can. Text editing, for one, but also for class notes, mastodon, wallabag, rss with elfeed… I&#39;ve set it up to change to dark mode automatically.
It replaces many of my other, dedicated applications. I still use Firefox for web-browsing and Thunderbird for calendar and emails. I also use Planify for my to-do list, which is synced with Nextcloud to my phone, where I use tasks.org. Every once in a while I also use Joplin, which was my go-to notes application before swicthing over to Emacs Org-mode.</p>
<p>
<em>To be continued…</em></p>
</div>
</div>







  </main>

  
<div class="backtotop">
    <div id="back-to-top" onclick="scrollToTop()">Back To Top</div>
</div>


  <footer class="footer">
    <script src="https://kit.fontawesome.com/0e8baee365.js" crossorigin="anonymous"></script>
    <span>&copy; 2025 Benedek Vigh. All rights reserved.</span>
    <span>
      <a href="https://mstdn.social/@whitecold" rel="me noopener noreferrer" target="_blank" title="Mastodon">
        <i class="fa-brands fa-mastodon"></i>
      </a>
      <a href="https://blog.benedekvigh.hu/index.xml" title="RSS">
	<i class="fa-solid fa-square-rss"></i>
      </a>
    </span>
</footer>

  <script src="/assets/js/theme-toggle-gen.js"></script></body>

</html>